# ColorBackgroundSettings Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ColorBackgroundSettings Members
ColorBackgroundSettings Class Methods Properties See Also
---
The ColorBackgroundSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from BackgroundSettings.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Color | The color of the rendering background. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from BackgroundSettings.) |

# See Also
ColorBackgroundSettings Class
Autodesk.Revit.DB Namespace